---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.DefaultIFCProjectTemplate
source: html/a8bf95d9-c656-3f2b-fa04-70d0dd6a8f2b.htm
---
# Autodesk.Revit.ApplicationServices.Application.DefaultIFCProjectTemplate Property

Full path to the default template file for new IFC project documents.
 It may be empty, in which case the DefaultProjectTemplate should be used.

## Syntax (C#)
```csharp
public string DefaultIFCProjectTemplate { get; }
```